constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    xmin
    {
        type            patch;
        nFaces          14400;
        startFace       7285400;
    }
    xmax
    {
        type            patch;
        nFaces          14400;
        startFace       7299800;
    }
    ymin
    {
        type            patch;
        nFaces          30600;
        startFace       7314200;
    }
    ymax
    {
        type            patch;
        nFaces          30600;
        startFace       7344800;
    }
    zmin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          13600;
        startFace       7375400;
    }
    zmax
    {
        type            patch;
        nFaces          13600;
        startFace       7389000;
    }
)

// ************************************************************************* //
