system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application      lpbfIcoReactingMultiphaseInterFoam;
startFrom        startTime;
startTime        0;

stopAt          endTime;
endTime          425e-06;
deltaT           2e-07;
writeControl     runTime;
writeInterval    1e-06;
purgeWrite       0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;
adjustTimeStep   yes;
maxCo            0.5;
maxDeltaT        1e-06;
maxAlphaCo       0.2;


// ************************************************************************* //
