system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// NOTE: The inert specie is defined everywhere.
// As it is not solved it fulfills the thermo requirement of Sum Y = 1
// in phases where there are not species
defaultFieldValues
(
    volScalarFieldValue alpha.argon       0
    volScalarFieldValue alpha.steel    0
    volScalarFieldValue alpha.Si       0
    volScalarFieldValue alpha.Fe   0

    volScalarFieldValue air.argon         1
    volScalarFieldValue vapour.argon      0
    volScalarFieldValue CO2.argon         0

    volScalarFieldValue O2.steel       0
    volScalarFieldValue water.steel    1
);

regions
(
    boxToCell
    {
        box (-0.1 -0.1 0) (0.5 0.5 1);
        fieldValues
        (
            volScalarFieldValue alpha.steel    1
            volScalarFieldValue O2.steel       0.01
            volScalarFieldValue water.steel    0.99
        );
    }

    boxToCell
    {
        box (0.5 0 0) (1 0.5 1);
        fieldValues
        (
            volScalarFieldValue alpha.Si       1
        );
    }

    boxToCell
    {
        box (0.5 0.5 0) (1 1.1 1);
        fieldValues
        (
            volScalarFieldValue alpha.Fe   1
        );
    }

    boxToCell
    {
        box (0 0.5 0) (0.5 1.1 1);
        fieldValues
        (
            volScalarFieldValue alpha.argon       1
            volScalarFieldValue vapour.argon      0.3
            volScalarFieldValue CO2.argon         0.2
            volScalarFieldValue air.argon         0.5
        );
    }
);


// ************************************************************************* //
